package utils

import "fmt"

// ANSI 颜色常量
const (
	ColorReset  = "\033[0m"
	ColorRed    = "\033[31m"
	ColorGreen  = "\033[32m"
	ColorYellow = "\033[33m"
	ColorBlue   = "\033[34m"
	ColorCyan   = "\033[36m"
	ColorBold   = "\033[1m"
)

// DisplayBanner 显示 ASCII 艺术字横幅
func DisplayBanner() {
	ascii := `

	░██████╗░██████╗░██╗░░░░░██████╗░░█████╗░████████╗░██████╗
	██╔════╝██╔═══██╗██║░░░░░██╔══██╗██╔══██╗╚══██╔══╝██╔════╝
	╚█████╗░██║██╗██║██║░░░░░██████╦╝██║░░██║░░░██║░░░╚█████╗░
	░╚═══██╗╚██████╔╝██║░░░░░██╔══██╗██║░░██║░░░██║░░░░╚═══██╗
	██████╔╝░╚═██╔═╝░███████╗██████╦╝╚█████╔╝░░░██║░░░██████╔╝
	╚═════╝░░░░╚═╝░░░╚══════╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═════╝░
`
	fmt.Printf("%s%s%s%s\n", ColorCyan, ColorBold, ascii, ColorReset)
}
